[
  {
    "name": "Bonk",
    "ticker": "BONK",
    "mintAddress": "DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263",
    "description": "The first Solana dog coin for the people, originally airdropped to the Solana community.",
    "funFact": "Bonk revived the Solana ecosystem in late 2022 when sentiment was at an all-time low."
  },
  {
    "name": "Dogwifhat",
    "ticker": "WIF",
    "mintAddress": "EKpQGSJtjMFqKZ9KQanSqYXRcF8fBopzLHYxdM65zcjm",
    "description": "A meme coin featuring a Shiba Inu wearing a pink knitted hat.",
    "funFact": "The original meme was sold as an NFT for thousands of dollars."
  },
  {
    "name": "Jupiter",
    "ticker": "JUP",
    "mintAddress": "JUPyiwrYJFskUPiHa7hkeR8VUtAeFoSYbKedZNsDvCN",
    "description": "The largest DEX aggregator on Solana, routing trades across multiple liquidity sources.",
    "funFact": "Jupiter processes billions in volume and is the go-to swap interface for most Solana users."
  },
  {
    "name": "Pyth Network",
    "ticker": "PYTH",
    "mintAddress": "HZ1JovNiVv35NJbF3YF3bVXb5Y5Y5Y5Y5Y5Y5Y5Y5Y5Y5",
    "description": "A decentralized oracle network providing real-time market data to DeFi protocols.",
    "funFact": "Pyth powers price feeds for major Solana DeFi protocols with sub-second updates."
  },
  {
    "name": "Samoyedcoin",
    "ticker": "SAMO",
    "mintAddress": "7xKXtg2CW87d97TXJSDpbD5jBkheTqA83TZRuJosgAsU",
    "description": "The official mascot of Solana, a friendly Samoyed dog representing the community.",
    "funFact": "SAMO was one of the earliest meme coins on Solana and helped build community spirit."
  },
  {
    "name": "Cope",
    "ticker": "COPE",
    "mintAddress": "8HGyAAB1yoM1ttS7pXjHMa3dukTFGQggnFFH3hJZgzQh",
    "description": "A meme coin about dealing with losses and moving forward in crypto.",
    "funFact": "COPE became popular during the 2021 bull run as traders needed to 'cope' with volatility."
  },
  {
    "name": "Step Finance",
    "ticker": "STEP",
    "mintAddress": "StepAscQoEioFxxWGnh2sLBDFp9d8rvKz2Yp39iDpyT",
    "description": "A portfolio management dashboard for Solana DeFi positions.",
    "funFact": "Step Finance was one of the first comprehensive DeFi dashboards on Solana."
  },
  {
    "name": "Raydium",
    "ticker": "RAY",
    "mintAddress": "4k3Dyjzvzp8eMZWUXbBCjEvwSkkk59S5iCNLY3QrkX6R",
    "description": "An automated market maker (AMM) and liquidity provider on Solana.",
    "funFact": "Raydium was the first major AMM on Solana and remains a core DeFi protocol."
  },
  {
    "name": "Orca",
    "ticker": "ORCA",
    "mintAddress": "orcaEKTdK7LKz57vaAYr9QeNsVEPfiu6QeMU1kektZE",
    "description": "A user-friendly DEX on Solana known for its clean interface and whale-friendly pools.",
    "funFact": "Orca's mascot is a friendly whale, and they focus on making DeFi accessible to everyone."
  },
  {
    "name": "Marinade",
    "ticker": "MNDE",
    "mintAddress": "MangoCzJ36AjZyKwVj3VnYU4GTonjfVEnJmvvWaxLac",
    "description": "A liquid staking protocol that lets you stake SOL and earn rewards while maintaining liquidity.",
    "funFact": "Marinade was the first liquid staking solution on Solana, unlocking staked SOL for DeFi."
  }
]
